frontend/controllers/HotController.php

    public function actionIndex()
    {
		$mall=DbsCouponCode::find()->all();
		$cate=DbsCouponCodeCategory::find()->all();
---
SELECT * FROM `dbs_coupon_code`
SELECT * FROM `dbs_coupon_code_category`

	public function actionSearch(){
            $cate=DbsCouponCodeCategory::find()->all();
             if($_GET['cate_id']){
                 $cat=$_GET['cate_id'];
                 $mall=DbsCouponCode::find()->where("y_id=".$_GET['cate_id'])->all();
             }else{
                  $cat=0;
                  $mall=DbsCouponCode::find()->all();
---
SELECT * FROM `dbs_coupon_code_category`
SELECT * FROM `dbs_coupon_code` WHERE y_id=10
SELECT * FROM `dbs_coupon_code`