frontend/controllers/MallController.php

	public function actionIndex(){
           $mall=CouponCodeMall::find()->all();
           $cate=CouponCodeCategory::find()->all();
---
SELECT * FROM `dbs_coupon_code_mall`
SELECT * FROM `dbs_coupon_code_category`

         public function actionSearch(){

            $cate=CouponCodeCategory::find()->all();
             if($_GET['cate_id']){
                 $cat=$_GET['cate_id'];
                 $mall=CouponCodeMall::find()->where("c_id=".$_GET['cate_id'])->all();
             }else{
                  $cat=0;
                  $mall=CouponCodeMall::find()->all();
---
SELECT * FROM `dbs_coupon_code_category`
SELECT * FROM `dbs_coupon_code_mall` WHERE cate_id=9
SELECT * FROM `dbs_coupon_code_mall`

         public function actionList(){
             //echo $_GET['m_id'];
            $list=CouponCodeMall::findOne($_GET['m_id']);
            $youhui=CouponCode::find()->where(['m_id'=>$_GET['m_id']])->all();
---
SELECT * FROM `dbs_coupon_code_mall` WHERE `m_id`='5'
SELECT * FROM `dbs_coupon_code` WHERE `m_id`='5'