frontend/controllers/NewController.php

	public function actionIndex(){
		//商家类型
	  $info =  DbsCouponCodeCategory::find()->all();
	  //$code =  CouponCode::find()->all();
	   //print_r($info);die;

     $model = new Query();
     $list=$model->from(['dbs_coupon_code','dbs_coupon_code_mall'])->where('dbs_coupon_code.m_id=dbs_coupon_code_mall.m_id');
	 $pages = new Pagination(['totalCount' =>$list->count(), 'pageSize' => '4']);
     $code = $list->offset($pages->offset)->limit($pages->limit)->all();
---
SELECT * FROM `dbs_coupon_code_category`
SELECT * FROM `dbs_coupon_code`, `dbs_coupon_code_mall` WHERE dbs_coupon_code.m_id=dbs_coupon_code_mall.m_id LIMIT 4 OFFSET 4
SELECT COUNT(*) FROM `dbs_coupon_code`, `dbs_coupon_code_mall` WHERE dbs_coupon_code.m_id=dbs_coupon_code_mall.m_id
SELECT * FROM `dbs_coupon_code`, `dbs_coupon_code_mall` WHERE dbs_coupon_code.m_id=dbs_coupon_code_mall.m_id LIMIT 4

	 public function actionSearch(){

            $info =  DbsCouponCodeCategory::find()->all();
             if($_GET['c_id']){
                 $cat=$_GET['c_id'];
				  $model = new Query();
				  $list=$model->from(['dbs_coupon_code_mall','dbs_coupon_code'])->where('dbs_coupon_code.m_id=dbs_coupon_code_mall.m_id')->andwhere("c_id=".$_GET['c_id']);
				//  echo $list->count();die;
	              $pages = new Pagination(['totalCount' =>$list->count(), 'pageSize' => '4']);
---
SELECT * FROM `dbs_coupon_code_category`
SELECT COUNT(*) FROM `dbs_coupon_code_mall`, `dbs_coupon_code` WHERE (dbs_coupon_code.m_id=dbs_coupon_code_mall.m_id) AND (c_id=10)
SELECT * FROM `dbs_coupon_code_mall`, `dbs_coupon_code` WHERE (dbs_coupon_code.m_id=dbs_coupon_code_mall.m_id) AND (c_id=10) LIMIT 4

	public function actionList(){
		$y_id=$_GET['y_id'];
	  $model = new Query();
	  $list=$model->from(['dbs_coupon_code','dbs_coupon_code_mall'])->where('dbs_coupon_code.m_id=dbs_coupon_code_mall.m_id')->andwhere("y_id=".$y_id)->one();
---
SELECT * FROM `dbs_coupon_code`, `dbs_coupon_code_mall` WHERE (dbs_coupon_code.m_id=dbs_coupon_code_mall.m_id) AND (y_id=9)