frontend/controllers/PromotionController.php

SELECT * FROM `dbs_mall_promotion`
SELECT * FROM `dbs_coupon_code_category`
---
	public function actionIndex(){


            $pro=MallPromotion::find()->all();
            //var_dump($pro);die;
            $cate= CouponCodeCategory::find()->all();