frontend/controllers/ReceiveController.php

SELECT * FROM `dbs_coupon_code_codes` WHERE user_id=
---
	public function actionIndex(){
             $session=new Session();
            $session->open();
            $codes=CouponCodeCodes::find()->where("user_id=".$session['user']['user_id'])->all();