frontend/controllers/SiteController.php

SELECT * FROM `dbs_coupon_code`
SELECT * FROM `dbs_coupon_code`, `dbs_coupon_code_mall` WHERE dbs_coupon_code.m_id=dbs_coupon_code_mall.m_id
SELECT * FROM `dbs_friend_link`
SELECT * FROM `dbs_coupon_code_mall`
---
	public function actionIndex(){
            $data=DbsCouponCode::find()->all();
              $model = new Query();
       $info= $model->from(['dbs_coupon_code','dbs_coupon_code_mall'])->where('dbs_coupon_code.m_id=dbs_coupon_code_mall.m_id')->all();

            $list=DbsFriendLink::find()->all();
            $mall=CouponCodeMall::find()->all();
            $code=  CouponCode::find()->all();