frontend/controllers/UserController.php

	public function actionCodes(){
            $session=new Session();
            $session->open();
            $codes=CouponCodeCodes::find()->where("user_id=".$session['user']['user_id'])->all();
---
SELECT * FROM `dbs_coupon_code_codes` WHERE user_id=8