frontend/controllers/ZhekouController.php

SELECT * FROM `dbs_zhekou_category`
SELECT * FROM `dbs_mall_zhekou`, `dbs_zhekou_category` WHERE dbs_mall_zhekou.cate_id=dbs_zhekou_category.id
---
	public function actionIndex(){
	 $model = new Query();
                        $list=DbsZhekouCategory::find()->all();

                        //var_dump($list);
	$data= $model->from(['dbs_mall_zhekou','dbs_zhekou_category'])->where("dbs_mall_zhekou.cate_id=dbs_zhekou_category.id")->all();